---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ConnectorManager
source: html/797ddd82-8847-e4ae-cc7e-879e0708d757.htm
---
# Autodesk.Revit.DB.FabricationPart.ConnectorManager Property

The connector manager of the fabrication part.

## Syntax (C#)
```csharp
public ConnectorManager ConnectorManager { get; }
```